
/*********************************************************************************************************
** 
**                               			北京交通大学                                     
**
**--------------------------------------------------------------------------------------------------------
** 	文件名：		Interface.h
** 	创建时间：		2014-1-22 14:30
** 	创建人员： 		赵秉贤
** 	文件描述:  		状态指示模块控制源文件
** 
**--------------------------------------------------------------------------------------------------------
** 	最后修改时间：	2014-1-22 14:30 
** 	最后修改人员：	赵秉贤	
** 	版本号： 	   	V1.0
** 	版本描述： 		进行初步的电机控制实验
**
*********************************************************************************************************/

#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_tim.h"

/*********************************************************************************************************
**	状态指示模块端口定义
*********************************************************************************************************/
#define	red 				GPIO_Pin_9							/*	红色LED灯	PB9	TIM4_CH4			*/
#define	green 				GPIO_Pin_8							/*	绿色LED灯	PB8	TIM4_CH3			*/
#define	blue				GPIO_Pin_7							/*	蓝色LED灯	PB7	TIM4_CH2			*/
#define	buzzer				GPIO_Pin_6							/*	蓝色LED灯	PB6	TIM4_CH1			*/

/*********************************************************************************************************
**	状态指示模块指示灯控制定义
*********************************************************************************************************/
#define	redLedOn 			TIM_SetCompare4(TIM4,50)			/*	红色LED灯开启						*/
#define	greenLedOn 			TIM_SetCompare3(TIM4,50)			/*	绿色LED灯开启						*/
#define	blueLedOn 			TIM_SetCompare2(TIM4,50)			/*	蓝色LED灯开启						*/

#define	redLedOff 			TIM_SetCompare4(TIM4,100)			/*	红色LED灯关闭						*/
#define	greenLedOff			TIM_SetCompare3(TIM4,100)			/*	绿色LED灯关闭						*/
#define	blueLedOff 			TIM_SetCompare2(TIM4,100)			/*	蓝色LED灯关闭						*/

#define	redLEDBlink			redLedOn;Delayms(1000);redLedOff	/*	红色LED闪烁1秒						*/	
#define	greenLEDBlink 		greenLedOn;Delayms(1000);greenLedOff/*	绿色LED闪烁1秒						*/		
#define	blueLEDBlink 		blueLedOn; Delayms(1000);blueLedOff /*	蓝色LED闪烁1秒						*/

/*********************************************************************************************************
**	状态指示函数声明
*********************************************************************************************************/
void InterfaceInit(void);
