
/*********************************************************************************************************
** 
**                               			北京交通大学                                     
**
**--------------------------------------------------------------------------------------------------------
** 	文件名：		IRSensor.h
** 	创建时间：		2013-7-16 11:15
** 	创建人员： 		赵秉贤
** 	文件描述:  		红外检测头文件
** 
**--------------------------------------------------------------------------------------------------------
** 	最后修改时间：	2013-7-16 11:15 
** 	最后修改人员：	赵秉贤	
** 	版本号： 	   	V1.0
** 	版本描述： 		红外检测ADC配合串口通信
**
*********************************************************************************************************/

#include "stm32f10x_adc.h"
#include "stm32f10x_dma.h"

/*********************************************************************************************************
**	红外传感器端口定义
*********************************************************************************************************/
#define	IR1 				GPIO_Pin_4							/*	红外传感器1 左方 	PC4				*/
#define	IR2  				GPIO_Pin_5							/*	红外传感器2 左前方	PC5				*/
#define	IR3 				GPIO_Pin_0							/*	红外传感器3 右前方	PB0				*/
#define	IR4  				GPIO_Pin_1							/*	红外传感器4 右方	PB1				*/

#define	ADC_1 				ADC_Channel_14						/*	红外传感器1 左方 	ADC通道14		*/
#define	ADC_2  				ADC_Channel_15						/*	红外传感器2 左前方	ADC通道15		*/
#define	ADC_3 				ADC_Channel_8						/*	红外传感器3 右前方	ADC通道8		*/
#define	ADC_4  				ADC_Channel_9						/*	红外传感器4 右方	ADC通道9		*/

#define	IR13Ctrl 			GPIO_Pin_10							/*	红外传感器1、3 控制端	PC10		*/
#define	IR24Ctrl  			GPIO_Pin_2							/*	红外传感器2、4 控制端	PA2			*/

#define	IR13On 				GPIOC->BSRR = GPIO_Pin_10			/*	红外传感器1、3 开	PC10			*/
#define	IR13Off 			GPIOC->BRR  = GPIO_Pin_10			/*	红外传感器1、3 关	PC10			*/
#define	IR24On  			GPIOA->BSRR = GPIO_Pin_2			/*	红外传感器2、4 开	PA2				*/
#define	IR24Off  			GPIOA->BRR  = GPIO_Pin_2			/*	红外传感器2、4 关	PA2				*/

#define ADC1_DR_Address		((u32)0x4001244C)					/*	DMA通道外设基地址					*/

/*********************************************************************************************************
**	红外传感器结构体定义
*********************************************************************************************************/
struct __IRSensor
{
	u8		IsCorrectionAllowed;								/*	红外矫正使能 TRUE：允许矫正		*/
	u8		CrosswayStatus[3];									/*	墙壁信息暂存 具体解释在下面			*/
	u16 	ADCValue[4];										/*	红外传感器ADC值存储					*/
	vu16 	ADCCache[4];										/*	DMA模式的ADC值暂存器				*/
	s32 	errorD[3];											/*	电脑鼠行走横向误差FOR PID			*/
	s32 	valueP, valueI, valueD, deltaPID;					/*	横向误差调整PID控制器参数			*/
	s32 	motorPID;											/*	横向误差调正PID控制器输出			*/
	s32 	lateralError;										/*	电脑鼠行走横向误差-实时				*/
	float	leftDis,rightDis;									/*	电脑鼠距离左右挡板的距离			*/
};
typedef struct __IRSensor IRSENSOR;								/*	重命名结构体motor					*/

																/*	CrosswayStatus[3]数据位功能解释		**
																**	bit0:三面有墙 坐标更新标志			**
																**	bit1:右侧有墙->无墙 坐标更新标志	**
																**	bit3:左侧有墙->无墙 坐标更新标志	**
																**	bit4:三面有墙 刹车标志位			**
																**	bit5:右侧有路口 判断标志位			**
																**	bit7:左侧有路口 判断标志位			*/

/*********************************************************************************************************
**	全局变量声明
*********************************************************************************************************/
extern IRSENSOR IRSensor;

/*********************************************************************************************************
**	红外检测函数声明
*********************************************************************************************************/
void SensorIRInit(void);
void SensorDMAInit(void);
void IRCheck(void);
void IRSensor_DisCorrection(void);
void IRSensor_ClearCache(void);
void IRSensor_Constructor(void);

