
/*********************************************************************************************************
** 
**                               			北京交通大学                                     
**
**--------------------------------------------------------------------------------------------------------
** 	文件名：		Regtarge.c
** 	创建时间：		2013-7-16 10:00
** 	创建人员： 		赵秉贤
** 	文件描述:  		重定义标准库中的printf函数
** 
**--------------------------------------------------------------------------------------------------------
** 	最后修改时间：	2013-7-16 10:00 
** 	最后修改人员：	赵秉贤	
** 	版本号： 	   	V1.0
** 	版本描述： 		红外检测ADC配合串口通信
**
*********************************************************************************************************/

#include <stdio.h>
#include <rt_misc.h>
#pragma import(__use_no_semihosting_swi)

/*********************************************************************************************************
**	重新定义printf函数
*********************************************************************************************************/
extern int SendChar(int ch); 												/*	声明外部函数			*/
extern int GetKey(void);				 									/*	在Usart.c中定义			*/

struct __FILE 
{
	int handle; 					
};

FILE __stdout;
FILE __stdin;

int fputc(int ch, FILE *f) 
{
	return (SendChar(ch));
}

int fgetc(FILE *f) 
{
	return (SendChar(GetKey()));
}

void _ttywrch(int ch) 
{
	SendChar (ch);
}
										  
int ferror(FILE *f) 					
{ 					
	return EOF;
}

void _sys_exit(int return_code) 
{
	label: goto label; 			
}

